QuAndy2016/STM8L_Discovery_SX1278_SFM1L/Project/SX1278/src/sx1276.c
/******************************************************************************
 * Project        : STM8L_Discovery_SX1278_SFM1L
 * File           : sx1276.c
 * Copyright      : 2014 Yosun Singapore Pte Ltd
 ******************************************************************************
  Change History:

    Version 1.0 - Sep 2014
    > Initial revision

******************************************************************************/
#include <string.h>
#include "sx1276.h"
#include "stm8l15x.h"
#include "stm8l15x_gpio.h"

static void SX1276InitIo( void );
static void SX1276Init( void );
static void SX1276Reset( void );
static void SX1276StartRx( void );
static void SX1276GetRxPacket( void *buffer, uint16_t *size );
static void SX1276SetTxPacket( const void *buffer, uint16_t size );
static uint32_t SX1276Process( void );
static void SX1276SetLoRaOn( void );
static uint8_t SX1276ReadDio0( void );
static uint8_t SX1276ReadDio1( void );
static uint8_t SX1276ReadDio2( void );
static uint8_t SX1276ReadDio3( void );
static uint8_t SX1276ReadDio4( void );
static uint8_t SX1276ReadDio5( void );
static uint8_t SX1276LoRaReadRxGain( void );
static void SX1276LoRaInit( void );
static void SX1276LoRaSetLoRaOn( void );
//static void SX1276LoRaSetSpreadingFactor( uint8_t factor );
//static void SX1276LoRaSetErrorCoding( uint8_t value );
//static void SX1276LoRaSetPacketCrcOn( bool enable );
//static void SX1276LoRaSetSignalBandwidth( uint8_t bw );
//static void SX1276LoRaSetImplicitHeaderOn( bool enable );
//static void SX1276LoRaSetSymbTimeout( uint16_t value );
//static void SX1276LoRaSetPayloadLength( uint8_t value );
//static void SX1276LoRaSetLowDatarateOptimize( bool enable );
static void SX1276LoRaSetPAOutput( uint8_t outputPin );
static void SX1276LoRaSetPa20dBm( bool enale );
static void SX1276LoRaSetRFPower( int8_t power );
static void SX1276LoRaSetNbTrigPeaks( uint8_t value );
static void SX1276LoRaSetRFState( uint8_t state );
static void SX1276LoRaGetRxPacket( void *buffer, uint16_t *size );
static void SX1276LoRaSetTxPacket( const void *buffer, uint16_t size );
static uint32_t SX1276LoRaProcess( void );
static void SX1276LoRaSetRFFrequency( uint32_t freq );
static void SX1276WriteRxTx( uint8_t txEnable );

#define YOSUN_SPI_DRIVER // Otherwise, SPI driver from STM lib would be used

#define GET_TICK_COUNT( )                           ( TickCounter )

// RXTX pin control
#define RXTX( txEnable )                            SX1276WriteRxTx( txEnable );

/*!
 * DIO state read functions mapping
 */
#define DIO0                                        SX1276ReadDio0( )
#define DIO1                                        SX1276ReadDio1( )
#define DIO2                                        SX1276ReadDio2( )
#define DIO3                                        SX1276ReadDio3( )
#define DIO4                                        SX1276ReadDio4( )
#define DIO5                                        SX1276ReadDio5( )

#define GPIO_WriteLow(a, b) GPIO_WriteBit(a, b, RESET)
#define GPIO_WriteHigh(a, b) GPIO_WriteBit(a, b, SET)
#define GPIO_ReadInputPin(a, b) GPIO_ReadInputDataBit(a, b)

static tRadioDriver RadioDriver;
static uint8_t SX1276Regs[0x71];
// System tick (1ms)
volatile uint32_t TickCounter = 0;

/*!
 * Precomputed signal bandwidth log values
 * Used to compute the Packet RSSI value.
 */
static const double SignalBwLog[] =
{
    3.8927900303521316335038277369285,  // 7.8 kHz
    4.0177301567005500940384239336392,  // 10.4 kHz
    4.193820026016112828717566631653,   // 15.6 kHz
    4.31875866931372901183597627752391, // 20.8 kHz
    4.4948500216800940239313055263775,  // 31.2 kHz
    4.6197891057238405255051280399961,  // 41.6 kHz
    4.795880017344075219145044421102,   // 62.5 kHz
    5.0969100130080564143587833158265,  // 125 kHz
    5.397940008672037609572522210551,   // 250 kHz
    5.6989700043360188047862611052755   // 500 kHz
};

static const double RssiOffsetLF[] =
{   // These values need to be specify in the Lab
    -155.0,
    -155.0,
    -155.0,
    -155.0,
    -155.0,
    -155.0,
    -155.0,
    -155.0,
    -155.0,
    -155.0,
};

static const double RssiOffsetHF[] =
{   // These values need to be specify in the Lab
    -150.0,
    -150.0,
    -150.0,
    -150.0,
    -150.0,
    -150.0,
    -150.0,
    -150.0,
    -150.0,
    -150.0,
};
/*!
 * Frequency hopping frequencies table
 */
static const int32_t HoppingFrequencies[] =
{
    916500000,
    923500000,
    906500000,
    917500000,
    917500000,
    909000000,
    903000000,
    916000000,
    912500000,
    926000000,
    925000000,
    909500000,
    913000000,
    918500000,
    918500000,
    902500000,
    911500000,
    926500000,
    902500000,
    922000000,
    924000000,
    903500000,
    913000000,
    922000000,
    926000000,
    910000000,
    920000000,
    922500000,
    911000000,
    922000000,
    909500000,
    926000000,
    922000000,
    918000000,
    925500000,
    908000000,
    917500000,
    926500000,
    908500000,
    916000000,
    905500000,
    916000000,
    903000000,
    905000000,
    915000000,
    913000000,
    907000000,
    910000000,
    926500000,
    925500000,
    911000000,
};

/*!
 * Rx management support variables
 */
static uint16_t RxPacketSize = 0;
static int8_t RxPacketSnrEstimate;
static double RxPacketRssiValue;
static uint8_t RxGain = 1;
static uint32_t RxTimeoutTimer = 0;
/*!
 * PacketTimeout Stores the Rx window time value for packet reception
 */
static uint32_t PacketTimeout;

/*!
 * SX1276 LoRa registers variable
 */
static tSX1276LR* SX1276LR;

/*!
 * RF state machine variable
 */
static uint8_t RFLRState = RFLR_STATE_IDLE;
/*!
 * Local RF buffer for communication support
 */
static uint8_t RFBuffer[RF_BUFFER_SIZE];

// Default settings
static tLoRaSettings LoRaSettings =
{
    532923000,        // RFFrequency
    20,               // Power
    1,                // SignalBw [0: 7.8kHz, 1: 10.4 kHz, 2: 15.6 kHz, 3: 20.8 kHz, 4: 31.2 kHz,
                      // 5: 41.6 kHz, 6: 62.5 kHz, 7: 125 kHz, 8: 250 kHz, 9: 500 kHz, other: Reserved]
    10,                // SpreadingFactor [6: 64, 7: 128, 8: 256, 9: 512, 10: 1024, 11: 2048, 12: 4096  chips]
    2,                // ErrorCoding [1: 4/5, 2: 4/6, 3: 4/7, 4: 4/8]
    TRUE,             // CrcOn [0: OFF, 1: ON]
    FALSE,            // ImplicitHeaderOn [0: OFF, 1: ON]
    FALSE,                // RxSingleOn [0: Continuous, 1 Single]
    FALSE,                // FreqHopOn [0: OFF, 1: ON]
    4,                // HopPeriod Hops every frequency hopping period symbols
    100,              // TxPacketTimeout
    100,              // RxPacketTimeout
    17,              // PayloadLength (used for implicit header mode)
};

/*!
 * Tx management support variables
 */
static uint16_t TxPacketSize = 0;

