QuAndy2016/STM8L_Discovery_SX1278_SFM1L/Project/SX1278/src/sx1276.c
#ifdef YOSUN_SPI_DRIVER
/*uint8_t SPI_read(uint8_t addr)
{
  uint8_t i = 0;
  uint8_t tmp = addr;
  
  GPIO_WriteLow(SPI_NSS_PORT, SPI_NSS_PIN);
  GPIO_WriteLow(SPI_SCK_PORT, SPI_SCK_PIN);
  
  for(i=8;i!=0;i--)
  {
    GPIO_WriteLow(SPI_SCK_PORT, SPI_SCK_PIN);
    if(tmp & 0x80)
    {
      GPIO_WriteHigh(SPI_MOSI_PORT, SPI_MOSI_PIN);
    }
    else
    {
      GPIO_WriteLow(SPI_MOSI_PORT, SPI_MOSI_PIN);
    }
    asm("nop");
    asm("nop");
    GPIO_WriteHigh(SPI_SCK_PORT, SPI_SCK_PIN);
    asm("nop");
    tmp <<= 1;
  }
  
  GPIO_WriteLow(SPI_SCK_PORT, SPI_SCK_PIN);
  GPIO_WriteHigh(SPI_MOSI_PORT, SPI_MOSI_PIN);
  
  GPIO_WriteLow(SPI_NSS_PORT, SPI_NSS_PIN);
  GPIO_WriteHigh(SPI_MOSI_PORT, SPI_MOSI_PIN);
  
  tmp = 0;
  for(i=8;i!=0;i--)
  {
    GPIO_WriteLow(SPI_SCK_PORT, SPI_SCK_PIN);
    asm("nop");
    asm("nop");
    tmp <<= 1;
    GPIO_WriteHigh(SPI_SCK_PORT, SPI_SCK_PIN);
    if(GPIO_ReadInputPin(SPI_MISO_PORT, SPI_MISO_PIN))
    {
      tmp |= 0x01;
    }
    else
    {
      tmp |= 0x00;
    }
  }
  GPIO_WriteLow(SPI_SCK_PORT, SPI_SCK_PIN);
  GPIO_WriteHigh(SPI_NSS_PORT, SPI_NSS_PIN);
  
  return tmp;
}

void SPI_write(uint8_t addr, uint8_t data)
{
  uint8_t tmp = addr;
  uint8_t i;
  
  GPIO_WriteLow(SPI_SCK_PORT, SPI_SCK_PIN);
  GPIO_WriteLow(SPI_NSS_PORT, SPI_NSS_PIN);
  
  tmp |= 0x80;
  for(i=8;i!=0;i--)
  {
    GPIO_WriteLow(SPI_SCK_PORT, SPI_SCK_PIN);
    asm("nop");
    asm("nop");
    if(tmp&0x80)
    {
      GPIO_WriteHigh(SPI_MOSI_PORT, SPI_MOSI_PIN);
    }
    else
    {
      GPIO_WriteLow(SPI_MOSI_PORT, SPI_MOSI_PIN);
    }
    GPIO_WriteHigh(SPI_SCK_PORT, SPI_SCK_PIN);
    tmp <<= 1;
  }
  
  tmp = data;
  for(i=8;i!=0;i--)
  {
    GPIO_WriteLow(SPI_SCK_PORT, SPI_SCK_PIN);
    asm("nop");
    asm("nop");
    if(tmp&0x80)
    {
      GPIO_WriteHigh(SPI_MOSI_PORT, SPI_MOSI_PIN);
    }
    else
    {
      GPIO_WriteLow(SPI_MOSI_PORT, SPI_MOSI_PIN);
    }
    GPIO_WriteHigh(SPI_SCK_PORT, SPI_SCK_PIN);
    tmp <<= 1;
  }
  
  GPIO_WriteLow(SPI_SCK_PORT, SPI_SCK_PIN);
  GPIO_WriteHigh(SPI_MOSI_PORT, SPI_MOSI_PIN);
  GPIO_WriteHigh(SPI_NSS_PORT, SPI_NSS_PIN);
}*/

void SPI_write(uint8_t addr, uint8_t *p_data, uint8_t length)
{
  uint8_t tmp = addr | 0x80;
  uint8_t i,j;
 
    GPIO_WriteLow(SPI_NSS_PORT, SPI_NSS_PIN);
    GPIO_WriteLow(SPI_SCK_PORT, SPI_SCK_PIN);
    
    for(i=8;i!=0;i--)
    {
      GPIO_WriteLow(SPI_SCK_PORT, SPI_SCK_PIN);
      if(tmp & 0x80)
      {
        GPIO_WriteHigh(SPI_MOSI_PORT, SPI_MOSI_PIN);
      }
      else
      {
        GPIO_WriteLow(SPI_MOSI_PORT, SPI_MOSI_PIN);
      }
      asm("nop");
      asm("nop");
      GPIO_WriteHigh(SPI_SCK_PORT, SPI_SCK_PIN);
      asm("nop");
      tmp <<= 1;
    }
    
    GPIO_WriteLow(SPI_SCK_PORT, SPI_SCK_PIN);
    GPIO_WriteHigh(SPI_MOSI_PORT, SPI_MOSI_PIN);
    
    for(j=0;j<length;j++)
    {
      tmp = p_data[j];
      
      GPIO_WriteLow(SPI_NSS_PORT, SPI_NSS_PIN);
      GPIO_WriteLow(SPI_SCK_PORT, SPI_SCK_PIN);
      
      for(i=8;i!=0;i--)
      {
        GPIO_WriteLow(SPI_SCK_PORT, SPI_SCK_PIN);
        if(tmp & 0x80)
        {
          GPIO_WriteHigh(SPI_MOSI_PORT, SPI_MOSI_PIN);
        }
        else
        {
          GPIO_WriteLow(SPI_MOSI_PORT, SPI_MOSI_PIN);
        }
        asm("nop");
        asm("nop");
        GPIO_WriteHigh(SPI_SCK_PORT, SPI_SCK_PIN);
        asm("nop");
        tmp <<= 1;
      }
      
      GPIO_WriteLow(SPI_SCK_PORT, SPI_SCK_PIN);
      GPIO_WriteHigh(SPI_MOSI_PORT, SPI_MOSI_PIN);
    }
    GPIO_WriteHigh(SPI_NSS_PORT, SPI_NSS_PIN);
}

void SPI_read(uint8_t addr, uint8_t *p_data, uint8_t length)
{
  uint8_t tmp = addr;
  uint8_t i,j;
  
    GPIO_WriteLow(SPI_NSS_PORT, SPI_NSS_PIN);
    GPIO_WriteLow(SPI_SCK_PORT, SPI_SCK_PIN);
    
    for(i=8;i!=0;i--)
    {
      GPIO_WriteLow(SPI_SCK_PORT, SPI_SCK_PIN);
      if(tmp & 0x80)
      {
        GPIO_WriteHigh(SPI_MOSI_PORT, SPI_MOSI_PIN);
      }
      else
      {
        GPIO_WriteLow(SPI_MOSI_PORT, SPI_MOSI_PIN);
      }
      asm("nop");
      asm("nop");
      GPIO_WriteHigh(SPI_SCK_PORT, SPI_SCK_PIN);
      asm("nop");
      tmp <<= 1;
    }
    
    GPIO_WriteLow(SPI_SCK_PORT, SPI_SCK_PIN);
    GPIO_WriteHigh(SPI_MOSI_PORT, SPI_MOSI_PIN);
    
    for(j=0;j<length;j++)
    {
      GPIO_WriteLow(SPI_NSS_PORT, SPI_NSS_PIN);
      GPIO_WriteHigh(SPI_MOSI_PORT, SPI_MOSI_PIN);
      
      tmp = 0;
      for(i=8;i!=0;i--)
      {
        GPIO_WriteLow(SPI_SCK_PORT, SPI_SCK_PIN);
        asm("nop");
        asm("nop");
        tmp <<= 1;
        GPIO_WriteHigh(SPI_SCK_PORT, SPI_SCK_PIN);
        if(GPIO_ReadInputPin(SPI_MISO_PORT, SPI_MISO_PIN))
        {
          tmp |= 0x01;
        }
        else
        {
          tmp |= 0x00;
        }
      }
      GPIO_WriteLow(SPI_SCK_PORT, SPI_SCK_PIN);
      p_data[j] = tmp;
    }
    GPIO_WriteHigh(SPI_NSS_PORT, SPI_NSS_PIN);
  
}
#else // SPI driver from STM lib
void SPI_read(uint8_t addr, uint8_t *p_data, uint8_t length)
{
  /*uint8_t tmp;
  
  GPIO_WriteLow(SPI_NSS_PORT, SPI_NSS_PIN);
  while(SPI_GetFlagStatus(SPI_FLAG_TXE) == RESET)
  {
    asm("nop");
  }
  SPI_SendData(addr);
  SPI_ReceiveData();
  while(SPI_GetFlagStatus(SPI_FLAG_RXNE) == SET)
  {
    asm("nop");
  }
  SPI_SendData(0xFF);
  tmp = SPI_ReceiveData();
  while(SPI_GetFlagStatus(SPI_FLAG_RXNE) == SET)
  {
    asm("nop");
  }
  //delay_ms(1);
  GPIO_WriteHigh(SPI_NSS_PORT, SPI_NSS_PIN);
  
  return tmp;*/
}

void SPI_write(uint8_t addr, uint8_t *p_data, uint8_t length)
{
  /*uint8_t data_h = addr | 0x80;
  uint8_t data_l = data;
  
  GPIO_WriteLow(SPI_NSS_PORT, SPI_NSS_PIN);
  while(SPI_GetFlagStatus(SPI_FLAG_TXE) == RESET)
  {
    asm("nop");
  }
  SPI_SendData(data_h);
  SPI_ReceiveData();
  while(SPI_GetFlagStatus(SPI_FLAG_RXNE) == SET)
  {
    asm("nop");
  }
  SPI_SendData(data_l);
  SPI_ReceiveData();
  while(SPI_GetFlagStatus(SPI_FLAG_RXNE) == SET)
  {
    asm("nop");
  }
  GPIO_WriteHigh(SPI_NSS_PORT, SPI_NSS_PIN);*/
}
#endif

void delay_ms(uint16_t ms)
{
  /* With fCPU = 16MHz, delay_ms(1) can approximated achieve 1ms delay */
  uint16_t i;
  
