QuAndy2016/STM8L_Discovery_SX1278_SFM1L/Project/SX1278/src/sx1276.c
  while(ms--)
  {
    for(i=0;i<2666;i++)
    {
    }
  }
}

static void SX1276InitIo( void )
{  
  /* Configure nREST as output push-pull low (LoRa module reset ON) */
  GPIO_Init(nREST_PORT, nREST_PIN, GPIO_Mode_Out_PP_Low_Fast);
  
  /* Configure CTRL1 as output push-pull low (SW control) */
  GPIO_Init(CTRL1_PORT, CTRL1_PIN, GPIO_Mode_Out_PP_Low_Fast);
  /* Configure CTRL2 as output push-pull low (SW control) */
  GPIO_Init(CTRL2_PORT, CTRL2_PIN, GPIO_Mode_Out_PP_Low_Fast);
  
  /* Configure Dio0 as input pull-up (LoRa software configurated) */
  GPIO_Init(DIO0_PORT, DIO0_PIN, GPIO_Mode_In_PU_No_IT);
  /* Configure Dio1 as input pull-up (LoRa software configurated) */
  GPIO_Init(DIO1_PORT, DIO1_PIN, GPIO_Mode_In_PU_No_IT);
  /* Configure Dio2 as input pull-up (LoRa software configurated) */
  GPIO_Init(DIO2_PORT, DIO2_PIN, GPIO_Mode_In_PU_No_IT);
  /* Configure Dio3 as input pull-up (LoRa software configurated) */
  GPIO_Init(DIO3_PORT, DIO3_PIN, GPIO_Mode_In_PU_No_IT);
  /* Configure Dio5 as input pull-up (LoRa software configurated) */
  GPIO_Init(DIO5_PORT, DIO5_PIN, GPIO_Mode_In_PU_No_IT);

#ifdef YOSUN_SPI_DRIVER
  /* Configure SPI_SCK as output push-pull low */
  GPIO_Init(SPI_SCK_PORT, SPI_SCK_PIN, GPIO_Mode_Out_PP_Low_Fast);
  /* Configure SPI_MOSI as output push-pull low */
  GPIO_Init(SPI_MOSI_PORT, SPI_MOSI_PIN, GPIO_Mode_Out_PP_Low_Fast);
  /* Configure SPI_MISO as input pull-up */
  GPIO_Init(SPI_MISO_PORT, SPI_MISO_PIN, GPIO_Mode_In_PU_No_IT);
#endif
  
  /* Initialize SPI */
#ifndef YOSUN_SPI_DRIVER
  SPI_DeInit();
  //CLK_PeripheralClockConfig(CLK_PERIPHERAL_SPI, ENABLE);
  //SPI_Init(SPI_FIRSTBIT_MSB, SPI_BAUDRATEPRESCALER_8, SPI_MODE_MASTER, SPI_CLOCKPOLARITY_LOW, SPI_CLOCKPHASE_1EDGE, SPI_DATADIRECTION_2LINES_FULLDUPLEX, SPI_NSS_SOFT, 0x07);
  SPI_Init(SPI_FIRSTBIT_MSB, SPI_BAUDRATEPRESCALER_256, SPI_MODE_MASTER, SPI_CLOCKPOLARITY_LOW, SPI_CLOCKPHASE_1EDGE, SPI_DATADIRECTION_2LINES_FULLDUPLEX, SPI_NSS_SOFT, 0x07);
  SPI_Cmd(ENABLE);
#endif
  
  /* Configure SPI_NSS as output push-pull low */
  GPIO_Init(SPI_NSS_PORT, SPI_NSS_PIN, GPIO_Mode_Out_PP_High_Fast);
  //GPIO_WriteHigh(SPI_NSS_PORT, SPI_NSS_PIN);
  delay_ms(1);
}

static void SX1276SetLoRaOn( void )
{
  SX1276LoRaSetLoRaOn();
}

static void SX1276Init( void )
{
  SX1276LR = ( tSX1276LR* )SX1276Regs;
  
  SX1276InitIo();
  
  /* Reset SX1276/78 */
  SX1276Reset();
  
  SX1276SetLoRaOn();
  
  SX1276LoRaInit();
}

static void SX1276Reset( void )
{
  GPIO_WriteHigh(nREST_PORT, nREST_PIN);
  /* wait 1ms */
  delay_ms(6);
  //GPIO_WriteLow(nREST_PORT, nREST_PIN);
  /* wait 6ms */
  //delay_ms(6);
}

static void SX1276StartRx( void )
{
  SX1276LoRaSetRFState( RFLR_STATE_RX_INIT );
}

static void SX1276GetRxPacket( void *buffer, uint16_t *size )
{
  SX1276LoRaGetRxPacket( buffer, size );
}

static void SX1276SetTxPacket( const void *buffer, uint16_t size )
{
  SX1276LoRaSetTxPacket( buffer, size );
}

static uint32_t SX1276Process( void )
{
  return SX1276LoRaProcess();
}

tRadioDriver* RadioDriverInit( void )
{
  RadioDriver.Init = SX1276Init;
  RadioDriver.Reset = SX1276Reset;
  RadioDriver.StartRx = SX1276StartRx;
  RadioDriver.GetRxPacket = SX1276GetRxPacket;
  RadioDriver.SetTxPacket = SX1276SetTxPacket;
  RadioDriver.Process = SX1276Process;
  
  return &RadioDriver;
}

static void SX1276LoRaSetRFState( uint8_t state )
{
    RFLRState = state;
}

static void SX1276LoRaGetRxPacket( void *buffer, uint16_t *size )
{
    *size = RxPacketSize;
    RxPacketSize = 0;
    memcpy( ( void * )buffer, ( void * )RFBuffer, ( size_t )*size );
}

static void SX1276LoRaSetTxPacket( const void *buffer, uint16_t size )
{
  if( LoRaSettings.FreqHopOn == FALSE )
  {
    
    TxPacketSize = size;
  }
  else
  {
    TxPacketSize = 255;
  }
  memcpy( ( void * )RFBuffer, buffer, ( size_t )TxPacketSize ); 

  RFLRState = RFLR_STATE_TX_INIT;
}

void SX1276LoRaSetOpMode( uint8_t opMode )
{
    static uint8_t opModePrev = RFLR_OPMODE_STANDBY;
    static bool antennaSwitchTxOnPrev = TRUE;
    bool antennaSwitchTxOn = FALSE;
    
    opModePrev = SX1276LR->RegOpMode & ~RFLR_OPMODE_MASK;

    if( opMode != opModePrev )
    {
      if( opMode == RFLR_OPMODE_TRANSMITTER )
      {
        antennaSwitchTxOn = TRUE;
      }
      else
      {
        antennaSwitchTxOn = FALSE;
      }
      if( antennaSwitchTxOn != antennaSwitchTxOnPrev )
      {
        antennaSwitchTxOnPrev = antennaSwitchTxOn;
        RXTX( antennaSwitchTxOn ); // Antenna switch control
      }
      SX1276LR->RegOpMode = ( SX1276LR->RegOpMode & RFLR_OPMODE_MASK ) | opMode;

      SPI_write( REG_LR_OPMODE, &(SX1276LR->RegOpMode), 1 );        
    }
}

static void SX1276LoRaSetLoRaOn( void )        
{
  SX1276LoRaSetOpMode( RFLR_OPMODE_SLEEP );
        
  SX1276LR->RegOpMode = ( SX1276LR->RegOpMode & RFLR_OPMODE_LONGRANGEMODE_MASK ) | RFLR_OPMODE_LONGRANGEMODE_ON;
  SPI_write( REG_LR_OPMODE, &(SX1276LR->RegOpMode), 1 );
        
  SX1276LoRaSetOpMode( RFLR_OPMODE_STANDBY );
                                        // RxDone               RxTimeout                   FhssChangeChannel           CadDone
  SX1276LR->RegDioMapping1 = RFLR_DIOMAPPING1_DIO0_00 | RFLR_DIOMAPPING1_DIO1_00 | RFLR_DIOMAPPING1_DIO2_00 | RFLR_DIOMAPPING1_DIO3_00;
                                        // CadDetected          ModeReady
  SX1276LR->RegDioMapping2 = RFLR_DIOMAPPING2_DIO4_00 | RFLR_DIOMAPPING2_DIO5_00;
  SPI_write( REG_LR_DIOMAPPING1, &(SX1276LR->RegDioMapping1), 2 );
}

/*!
 * \brief Process the LoRa modem Rx and Tx state machines depending on the
 *        SX1276 operating mode.
 *
 * \retval rfState Current RF state [RF_IDLE, RF_BUSY, 
 *                                   RF_RX_DONE, RF_RX_TIMEOUT,
 *                                   RF_TX_DONE, RF_TX_TIMEOUT]
 */
static uint32_t SX1276LoRaProcess( void )
{
    uint32_t result = RF_BUSY;
    uint8_t tmp = 0;
    
    switch( RFLRState )
    {
      case RFLR_STATE_IDLE:
          break;
      case RFLR_STATE_RX_INIT:
          
          SX1276LoRaSetOpMode( RFLR_OPMODE_STANDBY );

          SX1276LR->RegIrqFlagsMask = RFLR_IRQFLAGS_RXTIMEOUT |
                                      //RFLR_IRQFLAGS_RXDONE |
                                      //RFLR_IRQFLAGS_PAYLOADCRCERROR |
                                      RFLR_IRQFLAGS_VALIDHEADER |
                                      RFLR_IRQFLAGS_TXDONE |
                                      RFLR_IRQFLAGS_CADDONE |
                                      //RFLR_IRQFLAGS_FHSSCHANGEDCHANNEL |
                                      RFLR_IRQFLAGS_CADDETECTED;
          SPI_write( REG_LR_IRQFLAGSMASK, &(SX1276LR->RegIrqFlagsMask), 1 );

