QuAndy2016/STM8L_Discovery_SX1278_SFM1L/Project/SX1278/src/sx1276.c
          if( LoRaSettings.FreqHopOn == TRUE )
          {
              SX1276LR->RegHopPeriod = LoRaSettings.HopPeriod;

              SPI_read(REG_LR_HOPCHANNEL, &(SX1276LR->RegHopChannel), 1);
              SX1276LoRaSetRFFrequency( HoppingFrequencies[SX1276LR->RegHopChannel & RFLR_HOPCHANNEL_CHANNEL_MASK] );
          }
          else
          {
              SX1276LR->RegHopPeriod = 255;
          }
          
          SPI_write( REG_LR_HOPPERIOD, &(SX1276LR->RegHopPeriod), 1 );
                  
                                      // RxDone                    RxTimeout                   FhssChangeChannel           CadDone
          SX1276LR->RegDioMapping1 = RFLR_DIOMAPPING1_DIO0_00 | RFLR_DIOMAPPING1_DIO1_00 | RFLR_DIOMAPPING1_DIO2_00 | RFLR_DIOMAPPING1_DIO3_00;
                                      // CadDetected               ModeReady
          SX1276LR->RegDioMapping2 = RFLR_DIOMAPPING2_DIO4_00 | RFLR_DIOMAPPING2_DIO5_00;
          SPI_write( REG_LR_DIOMAPPING1, &(SX1276LR->RegDioMapping1), 2 );
      
          if( LoRaSettings.RxSingleOn == TRUE ) // Rx single mode
          {

              SX1276LoRaSetOpMode( RFLR_OPMODE_RECEIVER_SINGLE );
          }
          else // Rx continuous mode
          {
              SX1276LR->RegFifoAddrPtr = SX1276LR->RegFifoRxBaseAddr;
              SPI_write( REG_LR_FIFOADDRPTR, &(SX1276LR->RegFifoAddrPtr), 1 );
              
              SX1276LoRaSetOpMode( RFLR_OPMODE_RECEIVER );
          }
          
          memset( RFBuffer, 0, ( size_t )RF_BUFFER_SIZE );

          PacketTimeout = LoRaSettings.RxPacketTimeout;
          RxTimeoutTimer = GET_TICK_COUNT( );
          RFLRState = RFLR_STATE_RX_RUNNING;
          break;
      case RFLR_STATE_RX_RUNNING:
          
          if( DIO0 == 1 ) // RxDone
          {
              RxTimeoutTimer = GET_TICK_COUNT( );
              if( LoRaSettings.FreqHopOn == TRUE )
              {
                  SPI_read( REG_LR_HOPCHANNEL, &(SX1276LR->RegHopChannel), 1 );
                  SX1276LoRaSetRFFrequency( HoppingFrequencies[SX1276LR->RegHopChannel & RFLR_HOPCHANNEL_CHANNEL_MASK] );
              }
              // Clear Irq
              tmp = RFLR_IRQFLAGS_RXDONE;
              SPI_write( REG_LR_IRQFLAGS, &tmp, 1  );
              RFLRState = RFLR_STATE_RX_DONE;
              //GPIO_WriteLow(GPIOD, GPIO_PIN_0);
          }
          if( DIO2 == 1 ) // FHSS Changed Channel
          {
              RxTimeoutTimer = GET_TICK_COUNT( );
              if( LoRaSettings.FreqHopOn == TRUE )
              {
                  SPI_read( REG_LR_HOPCHANNEL, &(SX1276LR->RegHopChannel), 1 );
                  SX1276LoRaSetRFFrequency( HoppingFrequencies[SX1276LR->RegHopChannel & RFLR_HOPCHANNEL_CHANNEL_MASK] );
              }
              // Clear Irq
              tmp = RFLR_IRQFLAGS_FHSSCHANGEDCHANNEL;
              SPI_write( REG_LR_IRQFLAGS, &tmp, 1 );
              // Debug
              RxGain = SX1276LoRaReadRxGain( );
          }

          /*if( LoRaSettings.RxSingleOn == TRUE ) // Rx single mode
          {
              if( ( GET_TICK_COUNT( ) - RxTimeoutTimer ) > PacketTimeout )
              {
                  RFLRState = RFLR_STATE_RX_TIMEOUT;
              }
          }*/
          break;
      case RFLR_STATE_RX_DONE:
          SPI_read( REG_LR_IRQFLAGS, &(SX1276LR->RegIrqFlags), 1 );
          if( ( SX1276LR->RegIrqFlags & RFLR_IRQFLAGS_PAYLOADCRCERROR ) == RFLR_IRQFLAGS_PAYLOADCRCERROR )
          {
              // Clear Irq
              tmp = RFLR_IRQFLAGS_PAYLOADCRCERROR;
              SPI_write( REG_LR_IRQFLAGS, &tmp, 1  );
              
              if( LoRaSettings.RxSingleOn == TRUE ) // Rx single mode
              {
                  RFLRState = RFLR_STATE_RX_INIT;
              }
              else
              {
                  RFLRState = RFLR_STATE_RX_RUNNING;
              }
              break;
          }
          
          {
              uint8_t rxSnrEstimate;
              SPI_read( REG_LR_PKTSNRVALUE, &rxSnrEstimate, 1 );
              if( rxSnrEstimate & 0x80 ) // The SNR sign bit is 1
              {
                  // Invert and divide by 4
                  RxPacketSnrEstimate = ( ( ~rxSnrEstimate + 1 ) & 0xFF ) >> 2;
                  RxPacketSnrEstimate = -RxPacketSnrEstimate;
              }
              else
              {
                  // Divide by 4
                  RxPacketSnrEstimate = ( rxSnrEstimate & 0xFF ) >> 2;
              }
          }
          
          if( LoRaSettings.RFFrequency < 860000000 )  // LF
          {    
              if( RxPacketSnrEstimate < 0 )
              {
                  RxPacketRssiValue = NOISE_ABSOLUTE_ZERO + 10.0 * SignalBwLog[LoRaSettings.SignalBw] + NOISE_FIGURE_LF + ( double )RxPacketSnrEstimate;
              }
              else
              {    
                  SPI_read( REG_LR_PKTRSSIVALUE, &(SX1276LR->RegPktRssiValue), 1 );
                  RxPacketRssiValue = RssiOffsetLF[LoRaSettings.SignalBw] + ( double )SX1276LR->RegPktRssiValue;
              }
          }
          else                                        // HF
          {    
              if( RxPacketSnrEstimate < 0 )
              {
                  RxPacketRssiValue = NOISE_ABSOLUTE_ZERO + 10.0 * SignalBwLog[LoRaSettings.SignalBw] + NOISE_FIGURE_HF + ( double )RxPacketSnrEstimate;
              }
              else
              {    
                  SPI_read( REG_LR_PKTRSSIVALUE, &(SX1276LR->RegPktRssiValue), 1 );
                  RxPacketRssiValue = RssiOffsetHF[LoRaSettings.SignalBw] + ( double )SX1276LR->RegPktRssiValue;
              }
          }

          if( LoRaSettings.RxSingleOn == TRUE ) // Rx single mode
          {
              SX1276LR->RegFifoAddrPtr = SX1276LR->RegFifoRxBaseAddr;
              SPI_write( REG_LR_FIFOADDRPTR, &(SX1276LR->RegFifoAddrPtr), 1 );

              if( LoRaSettings.ImplicitHeaderOn == TRUE )
              {
                  RxPacketSize = SX1276LR->RegPayloadLength;
                  SPI_read(REG_LR_FIFO, RFBuffer, SX1276LR->RegPayloadLength);
              }
              else
              {
                  SPI_read( REG_LR_NBRXBYTES, &(SX1276LR->RegNbRxBytes), 1 );
                  RxPacketSize = SX1276LR->RegNbRxBytes;
                  SPI_read(REG_LR_FIFO, RFBuffer, SX1276LR->RegNbRxBytes );
              }
          }
          else // Rx continuous mode
          {
              SPI_read( REG_LR_FIFORXCURRENTADDR, &(SX1276LR->RegFifoRxCurrentAddr), 1 );

