QuAndy2016/STM8L_Discovery_SX1278_SFM1L/Project/SX1278/src/sx1276.c
              if( LoRaSettings.ImplicitHeaderOn == TRUE )
              {
                  RxPacketSize = SX1276LR->RegPayloadLength;
                  SX1276LR->RegFifoAddrPtr = SX1276LR->RegFifoRxCurrentAddr;
                  SPI_write( REG_LR_FIFOADDRPTR, &(SX1276LR->RegFifoAddrPtr), 1 );
                  SPI_read(REG_LR_FIFO, RFBuffer, SX1276LR->RegPayloadLength );
              }
              else
              {
                  SPI_read( REG_LR_NBRXBYTES, &(SX1276LR->RegNbRxBytes), 1 );
                  RxPacketSize = SX1276LR->RegNbRxBytes;
                  SX1276LR->RegFifoAddrPtr = SX1276LR->RegFifoRxCurrentAddr;
                  SPI_write( REG_LR_FIFOADDRPTR, &(SX1276LR->RegFifoAddrPtr), 1 );
                  SPI_read(REG_LR_FIFO, RFBuffer, SX1276LR->RegNbRxBytes );
              }
          }
          
          if( LoRaSettings.RxSingleOn == TRUE ) // Rx single mode
          {
              RFLRState = RFLR_STATE_RX_INIT;
          }
          else // Rx continuous mode
          {
              RFLRState = RFLR_STATE_RX_RUNNING;
          }
          result = RF_RX_DONE;
          break;
      case RFLR_STATE_RX_TIMEOUT:
          RFLRState = RFLR_STATE_RX_INIT;
          result = RF_RX_TIMEOUT;
          break;
      case RFLR_STATE_TX_INIT:

          SX1276LoRaSetOpMode( RFLR_OPMODE_STANDBY );

          if( LoRaSettings.FreqHopOn == TRUE )
          {
              SX1276LR->RegIrqFlagsMask = RFLR_IRQFLAGS_RXTIMEOUT |
                                          RFLR_IRQFLAGS_RXDONE |
                                          RFLR_IRQFLAGS_PAYLOADCRCERROR |
                                          RFLR_IRQFLAGS_VALIDHEADER |
                                          //RFLR_IRQFLAGS_TXDONE |
                                          RFLR_IRQFLAGS_CADDONE |
                                          //RFLR_IRQFLAGS_FHSSCHANGEDCHANNEL |
                                          RFLR_IRQFLAGS_CADDETECTED;
              SX1276LR->RegHopPeriod = LoRaSettings.HopPeriod;

              SPI_read( REG_LR_HOPCHANNEL, &(SX1276LR->RegHopChannel), 1 );
              SX1276LoRaSetRFFrequency( HoppingFrequencies[SX1276LR->RegHopChannel & RFLR_HOPCHANNEL_CHANNEL_MASK] );
          }
          else
          {
              SX1276LR->RegIrqFlagsMask = RFLR_IRQFLAGS_RXTIMEOUT |
                                          RFLR_IRQFLAGS_RXDONE |
                                          RFLR_IRQFLAGS_PAYLOADCRCERROR |
                                          RFLR_IRQFLAGS_VALIDHEADER |
                                          //RFLR_IRQFLAGS_TXDONE |
                                          RFLR_IRQFLAGS_CADDONE |
                                          RFLR_IRQFLAGS_FHSSCHANGEDCHANNEL |
                                          RFLR_IRQFLAGS_CADDETECTED;
              SX1276LR->RegHopPeriod = 0;
          }
          SPI_write( REG_LR_HOPPERIOD, &(SX1276LR->RegHopPeriod), 1 );
          SPI_write( REG_LR_IRQFLAGSMASK, &(SX1276LR->RegIrqFlagsMask), 1 );

          // Initializes the payload size
          SX1276LR->RegPayloadLength = TxPacketSize;
          SPI_write( REG_LR_PAYLOADLENGTH, &(SX1276LR->RegPayloadLength), 1 );
          
          SX1276LR->RegFifoTxBaseAddr = 0x00; // Full buffer used for Tx
          SPI_write( REG_LR_FIFOTXBASEADDR, &(SX1276LR->RegFifoTxBaseAddr), 1 );

          SX1276LR->RegFifoAddrPtr = SX1276LR->RegFifoTxBaseAddr;
          SPI_write( REG_LR_FIFOADDRPTR, &(SX1276LR->RegFifoAddrPtr), 1 );
          
          // Write payload buffer to LORA modem
          SPI_write( REG_LR_FIFO, RFBuffer, SX1276LR->RegPayloadLength );
                                          // TxDone               RxTimeout                   FhssChangeChannel          ValidHeader         
          SX1276LR->RegDioMapping1 = RFLR_DIOMAPPING1_DIO0_01 | RFLR_DIOMAPPING1_DIO1_00 | RFLR_DIOMAPPING1_DIO2_00 | RFLR_DIOMAPPING1_DIO3_01;
                                          // PllLock              Mode Ready
          SX1276LR->RegDioMapping2 = RFLR_DIOMAPPING2_DIO4_01 | RFLR_DIOMAPPING2_DIO5_00;
          SPI_write( REG_LR_DIOMAPPING1, &(SX1276LR->RegDioMapping1), 2 );

          SX1276LoRaSetOpMode( RFLR_OPMODE_TRANSMITTER );

          RFLRState = RFLR_STATE_TX_RUNNING;
          break;
      case RFLR_STATE_TX_RUNNING:
          if( DIO0 == 1 ) // TxDone
          {
              // Clear Irq
              tmp = RFLR_IRQFLAGS_TXDONE;
              SPI_write( REG_LR_IRQFLAGS, &tmp, 1 );
              RFLRState = RFLR_STATE_TX_DONE;   
          }
          if( DIO2 == 1 ) // FHSS Changed Channel
          {
              if( LoRaSettings.FreqHopOn == TRUE )
              {
                  SPI_read( REG_LR_HOPCHANNEL, &(SX1276LR->RegHopChannel), 1 );
                  SX1276LoRaSetRFFrequency( HoppingFrequencies[SX1276LR->RegHopChannel & RFLR_HOPCHANNEL_CHANNEL_MASK] );
              }
              // Clear Irq
              tmp = RFLR_IRQFLAGS_FHSSCHANGEDCHANNEL;
              SPI_write( REG_LR_IRQFLAGS, &tmp, 1 );
          }
          break;
      case RFLR_STATE_TX_DONE:
          // optimize the power consumption by switching off the transmitter as soon as the packet has been sent
          SX1276LoRaSetOpMode( RFLR_OPMODE_STANDBY );

          RFLRState = RFLR_STATE_IDLE;
          result = RF_TX_DONE;
          break;
      case RFLR_STATE_CAD_INIT:    
          SX1276LoRaSetOpMode( RFLR_OPMODE_STANDBY );
      
          SX1276LR->RegIrqFlagsMask = RFLR_IRQFLAGS_RXTIMEOUT |
                                      RFLR_IRQFLAGS_RXDONE |
                                      RFLR_IRQFLAGS_PAYLOADCRCERROR |
                                      RFLR_IRQFLAGS_VALIDHEADER |
                                      RFLR_IRQFLAGS_TXDONE |
                                      //RFLR_IRQFLAGS_CADDONE |
                                      RFLR_IRQFLAGS_FHSSCHANGEDCHANNEL; // |
                                      //RFLR_IRQFLAGS_CADDETECTED;
          SPI_write( REG_LR_IRQFLAGSMASK, &(SX1276LR->RegIrqFlagsMask), 1 );
             
                                      // RxDone                   RxTimeout                   FhssChangeChannel           CadDone
          SX1276LR->RegDioMapping1 = RFLR_DIOMAPPING1_DIO0_00 | RFLR_DIOMAPPING1_DIO1_00 | RFLR_DIOMAPPING1_DIO2_00 | RFLR_DIOMAPPING1_DIO3_00;
                                      // CAD Detected              ModeReady
          SX1276LR->RegDioMapping2 = RFLR_DIOMAPPING2_DIO4_00 | RFLR_DIOMAPPING2_DIO5_00;
          SPI_write( REG_LR_DIOMAPPING1, &(SX1276LR->RegDioMapping1), 2 );
              
          SX1276LoRaSetOpMode( RFLR_OPMODE_CAD );
          RFLRState = RFLR_STATE_CAD_RUNNING;
          break;
      case RFLR_STATE_CAD_RUNNING:
          if( DIO3 == 1 ) //CAD Done interrupt
          { 
              // Clear Irq
              tmp = RFLR_IRQFLAGS_CADDONE;
              SPI_write( REG_LR_IRQFLAGS, &tmp, 1 );
              if( DIO4 == 1 ) // CAD Detected interrupt
              {
                  // Clear Irq
                  tmp = RFLR_IRQFLAGS_CADDETECTED;
                  SPI_write( REG_LR_IRQFLAGS, &tmp, 1 );
                  // CAD detected, we have a LoRa preamble
                  RFLRState = RFLR_STATE_RX_INIT;
                  result = RF_CHANNEL_ACTIVITY_DETECTED;
              } 
              else
              {    
                  // The device goes in Standby Mode automatically    
                  RFLRState = RFLR_STATE_IDLE;
                  result = RF_CHANNEL_EMPTY;
              }
          }   
          break;
      
      default:
          break;
    } 
    return result;
}

