QuAndy2016/STM8L_Discovery_SX1278_SFM1L/Project/SX1278/src/sx1276.c
static void SX1276LoRaSetRFFrequency( uint32_t freq )
{
    LoRaSettings.RFFrequency = freq;

    freq = ( uint32_t )( ( double )freq / ( double )FREQ_STEP );
    SX1276LR->RegFrfMsb = ( uint8_t )( ( freq >> 16 ) & 0xFF );
    SX1276LR->RegFrfMid = ( uint8_t )( ( freq >> 8 ) & 0xFF );
    SX1276LR->RegFrfLsb = ( uint8_t )( freq & 0xFF );
    SPI_write( REG_LR_FRFMSB, &(SX1276LR->RegFrfMsb), 3 );
}

static uint8_t SX1276ReadDio0( void )
{
    return ((uint8_t)GPIO_ReadInputPin( DIO0_PORT, DIO0_PIN ));
}

static uint8_t SX1276ReadDio1( void )
{
    return ((uint8_t)GPIO_ReadInputPin( DIO1_PORT, DIO1_PIN ));
}

static uint8_t SX1276ReadDio2( void )
{
    return ((uint8_t)GPIO_ReadInputPin( DIO2_PORT, DIO2_PIN ));
}

static uint8_t SX1276ReadDio3( void )
{
    return ((uint8_t)GPIO_ReadInputPin( DIO3_PORT, DIO3_PIN ));
}

static uint8_t SX1276ReadDio4( void )
{
    //return GPIO_ReadInputPin( DIO4_PORT, DIO4_PIN );
  return 0;
}

static uint8_t SX1276ReadDio5( void )
{
    return ((uint8_t)GPIO_ReadInputPin( DIO5_PORT, DIO5_PIN ));
}

static uint8_t SX1276LoRaReadRxGain( void )
{
    SPI_read( REG_LR_LNA, &(SX1276LR->RegLna), 1 );
    return( SX1276LR->RegLna >> 5 ) & 0x07;
}

static void SX1276LoRaInit( void )
{
    uint32_t freq;
    
    RFLRState = RFLR_STATE_IDLE;

    // Read out all register settings
    SPI_read( REG_LR_OPMODE, SX1276Regs + 1, 0x70 );
    
    // use TCXO
    SX1276LR->RegTcxo = (SX1276LR->RegTcxo & 0xEF) | 0x10;
    
    // Set max LNA gain
    SX1276LR->RegLna = (SX1276LR->RegLna & ~RFLR_LNA_GAIN_G1) | RFLR_LNA_GAIN_G1;

    // set the RF settings 
    //SX1276LoRaSetRFFrequency( LoRaSettings.RFFrequency );
    freq = ( uint32_t )( ( double )LoRaSettings.RFFrequency / ( double )FREQ_STEP );
    SX1276LR->RegFrfMsb = ( uint8_t )( ( freq >> 16 ) & 0xFF );
    SX1276LR->RegFrfMid = ( uint8_t )( ( freq >> 8 ) & 0xFF );
    SX1276LR->RegFrfLsb = ( uint8_t )( freq & 0xFF );
    //SX1276LR->RegFrfMsb = 0x85;
    //SX1276LR->RegFrfMid = 0x3B;
    //SX1276LR->RegFrfLsb = 0x13;
    
    // Set PA ountpint to PA_BOOST
    // Enable +20dBm output power
    SX1276LR->RegPaConfig = (SX1276LR->RegPaConfig & ~RFLR_PACONFIG_PASELECT_PABOOST ) | RFLR_PACONFIG_PASELECT_PABOOST;
    SX1276LR->RegPaDac = 0x87;
    if( ( SX1276LR->RegPaConfig & RFLR_PACONFIG_PASELECT_PABOOST ) == RFLR_PACONFIG_PASELECT_PABOOST )
    {
        if( ( SX1276LR->RegPaDac & 0x87 ) == 0x87 )
        {
            if( LoRaSettings.Power < 5 )
            {
                LoRaSettings.Power = 5;
            }
            if( LoRaSettings.Power > 20 )
            {
                LoRaSettings.Power = 20;
            }
            SX1276LR->RegPaConfig = ( SX1276LR->RegPaConfig & RFLR_PACONFIG_MAX_POWER_MASK ) | 0x70;
            SX1276LR->RegPaConfig = ( SX1276LR->RegPaConfig & RFLR_PACONFIG_OUTPUTPOWER_MASK ) | ( ( LoRaSettings.Power - 5 ) & 0x0F );
        }
        else
        {
            if( LoRaSettings.Power < 2 )
            {
                LoRaSettings.Power = 2;
            }
            if( LoRaSettings.Power > 17 )
            {
                LoRaSettings.Power = 17;
            }
            SX1276LR->RegPaConfig = ( SX1276LR->RegPaConfig & RFLR_PACONFIG_MAX_POWER_MASK ) | 0x70;
            SX1276LR->RegPaConfig = ( SX1276LR->RegPaConfig & RFLR_PACONFIG_OUTPUTPOWER_MASK ) | ( ( LoRaSettings.Power - 2 ) & 0x0F );
        }
    }
    else
    {
        if( LoRaSettings.Power < -1 )
        {
            LoRaSettings.Power = -1;
        }
        if( LoRaSettings.Power > 14 )
        {
            LoRaSettings.Power = 14;
        }
        SX1276LR->RegPaConfig = ( SX1276LR->RegPaConfig & RFLR_PACONFIG_MAX_POWER_MASK ) | 0x70;
        SX1276LR->RegPaConfig = ( SX1276LR->RegPaConfig & RFLR_PACONFIG_OUTPUTPOWER_MASK ) | ( ( LoRaSettings.Power + 1 ) & 0x0F );
    }

    //SX1276LoRaSetSpreadingFactor( LoRaSettings.SpreadingFactor ); // SF6 only operates in implicit header mode.
    if(LoRaSettings.SpreadingFactor > 12)
    {
      LoRaSettings.SpreadingFactor = 12;
    }
    else if(LoRaSettings.SpreadingFactor <6)
    {
      LoRaSettings.SpreadingFactor = 6;
    }
    
    if(LoRaSettings.SpreadingFactor == 6)
    {
      SX1276LR->RegTestReserved31 = ( SX1276LR->RegTestReserved31 & 0xF8 ) | 5;
    }
    else
    {
      SX1276LR->RegTestReserved31 = ( SX1276LR->RegTestReserved31 & 0xF8 ) | 3;
    }
    SX1276LR->RegModemConfig2 = ( SX1276LR->RegModemConfig2 & RFLR_MODEMCONFIG2_SF_MASK ) | ( LoRaSettings.SpreadingFactor << 4 );
    
    //SX1276LoRaSetErrorCoding( LoRaSettings.ErrorCoding );
    SX1276LR->RegModemConfig1 = ( SX1276LR->RegModemConfig1 & RFLR_MODEMCONFIG1_CODINGRATE_MASK ) | ( LoRaSettings.ErrorCoding << 1 );
    
    //SX1276LoRaSetPacketCrcOn( LoRaSettings.CrcOn );
    SX1276LR->RegModemConfig2 = ( SX1276LR->RegModemConfig2 & RFLR_MODEMCONFIG2_RXPAYLOADCRC_MASK ) | ( LoRaSettings.CrcOn << 2 );

    //SX1276LoRaSetSignalBandwidth( LoRaSettings.SignalBw );
    SX1276LR->RegModemConfig1 = ( SX1276LR->RegModemConfig1 & RFLR_MODEMCONFIG1_BW_MASK ) | ( LoRaSettings.SignalBw << 4 );

    //SX1276LoRaSetImplicitHeaderOn( LoRaSettings.ImplicitHeaderOn );
    SX1276LR->RegModemConfig1 = ( SX1276LR->RegModemConfig1 & RFLR_MODEMCONFIG1_IMPLICITHEADER_MASK ) | ( LoRaSettings.ImplicitHeaderOn );
    
    //SX1276LoRaSetSymbTimeout( 0x3FF );
    SX1276LR->RegModemConfig2 = ( SX1276LR->RegModemConfig2 & RFLR_MODEMCONFIG2_SYMBTIMEOUTMSB_MASK ) | ( ( 0x3FF >> 8 ) & ~RFLR_MODEMCONFIG2_SYMBTIMEOUTMSB_MASK );
    SX1276LR->RegSymbTimeoutLsb = 0x3FF & 0xFF;
    
    //SX1276LoRaSetPayloadLength( LoRaSettings.PayloadLength );
    SX1276LR->RegPayloadLength = LoRaSettings.PayloadLength;

    //SX1276LoRaSetLowDatarateOptimize( TRUE );
    SX1276LR->RegModemConfig3 = ( SX1276LR->RegModemConfig3 & RFLR_MODEMCONFIG3_LOWDATARATEOPTIMIZE_MASK ) | ( TRUE << 3 );
    
    SX1276LR->RegPreambleMsb = 0;
    SX1276LR->RegPreambleLsb = 16;
    
    SPI_write( REG_LR_OPMODE, SX1276Regs + 1, 0x70 - 1 );
    
    SX1276LoRaSetOpMode( RFLR_OPMODE_STANDBY );
}

/*static void SX1276LoRaSetSpreadingFactor( uint8_t factor )
{

    if( factor > 12 )
    {
        factor = 12;
    }
    else if( factor < 6 )
    {
        factor = 6;
    }

    if( factor == 6 )
    {
        SX1276LoRaSetNbTrigPeaks( 5 );
    }
    else
    {
        SX1276LoRaSetNbTrigPeaks( 3 );
    }

    SPI_read( REG_LR_MODEMCONFIG2, &(SX1276LR->RegModemConfig2), 1 );    
    SX1276LR->RegModemConfig2 = ( SX1276LR->RegModemConfig2 & RFLR_MODEMCONFIG2_SF_MASK ) | ( factor << 4 );
    SPI_write( REG_LR_MODEMCONFIG2, &(SX1276LR->RegModemConfig2), 1 );    
    LoRaSettings.SpreadingFactor = factor;
}*/

