QuAndy2016/STM8L_Discovery_SX1278_SFM1L/Project/SX1278/src/sx1276.c
/*static void SX1276LoRaSetErrorCoding( uint8_t value )
{
    SPI_read( REG_LR_MODEMCONFIG1, &(SX1276LR->RegModemConfig1), 1 );
    SX1276LR->RegModemConfig1 = ( SX1276LR->RegModemConfig1 & RFLR_MODEMCONFIG1_CODINGRATE_MASK ) | ( value << 1 );
    SPI_write( REG_LR_MODEMCONFIG1, &(SX1276LR->RegModemConfig1), 1 );
    LoRaSettings.ErrorCoding = value;
}*/

/*static void SX1276LoRaSetPacketCrcOn( bool enable )
{
    SPI_read( REG_LR_MODEMCONFIG2, &(SX1276LR->RegModemConfig2), 1 );
    SX1276LR->RegModemConfig2 = ( SX1276LR->RegModemConfig2 & RFLR_MODEMCONFIG2_RXPAYLOADCRC_MASK ) | ( enable << 2 );
    SPI_write( REG_LR_MODEMCONFIG2, &(SX1276LR->RegModemConfig2), 1 );
    LoRaSettings.CrcOn = enable;
}*/

/*static void SX1276LoRaSetSignalBandwidth( uint8_t bw )
{
    SPI_read( REG_LR_MODEMCONFIG1, &(SX1276LR->RegModemConfig1), 1 );
    SX1276LR->RegModemConfig1 = ( SX1276LR->RegModemConfig1 & RFLR_MODEMCONFIG1_BW_MASK ) | ( bw << 4 );
    SPI_write( REG_LR_MODEMCONFIG1, &(SX1276LR->RegModemConfig1), 1 );
    LoRaSettings.SignalBw = bw;
}*/

/*static void SX1276LoRaSetImplicitHeaderOn( bool enable )
{
    SPI_read( REG_LR_MODEMCONFIG1, &(SX1276LR->RegModemConfig1), 1 );
    SX1276LR->RegModemConfig1 = ( SX1276LR->RegModemConfig1 & RFLR_MODEMCONFIG1_IMPLICITHEADER_MASK ) | ( enable );
    SPI_write( REG_LR_MODEMCONFIG1, &(SX1276LR->RegModemConfig1), 1 );
    LoRaSettings.ImplicitHeaderOn = enable;
}*/

/*static void SX1276LoRaSetSymbTimeout( uint16_t value )
{
    SPI_read( REG_LR_MODEMCONFIG2, &(SX1276LR->RegModemConfig2), 2 );

    SX1276LR->RegModemConfig2 = ( SX1276LR->RegModemConfig2 & RFLR_MODEMCONFIG2_SYMBTIMEOUTMSB_MASK ) | ( ( value >> 8 ) & ~RFLR_MODEMCONFIG2_SYMBTIMEOUTMSB_MASK );
    SX1276LR->RegSymbTimeoutLsb = value & 0xFF;
    SPI_write( REG_LR_MODEMCONFIG2, &(SX1276LR->RegModemConfig2), 2 );
}*/

/*static void SX1276LoRaSetPayloadLength( uint8_t value )
{
    SX1276LR->RegPayloadLength = value;
    SPI_write( REG_LR_PAYLOADLENGTH, &(SX1276LR->RegPayloadLength), 1 );
    LoRaSettings.PayloadLength = value;
}*/

/*static void SX1276LoRaSetLowDatarateOptimize( bool enable )
{
    SPI_read( REG_LR_MODEMCONFIG3, &(SX1276LR->RegModemConfig3), 1 );
    SX1276LR->RegModemConfig3 = ( SX1276LR->RegModemConfig3 & RFLR_MODEMCONFIG3_LOWDATARATEOPTIMIZE_MASK ) | ( enable << 3 );
    SPI_write( REG_LR_MODEMCONFIG3, &(SX1276LR->RegModemConfig3), 1 );
}*/

static void SX1276LoRaSetPAOutput( uint8_t outputPin )
{
    SPI_read( REG_LR_PACONFIG, &(SX1276LR->RegPaConfig), 1 );
    SX1276LR->RegPaConfig = (SX1276LR->RegPaConfig & RFLR_PACONFIG_PASELECT_MASK ) | outputPin;
    SPI_write( REG_LR_PACONFIG, &(SX1276LR->RegPaConfig), 1 );
}

static void SX1276LoRaSetPa20dBm( bool enale )
{
    SPI_read( REG_LR_PADAC, &(SX1276LR->RegPaDac), 1 );
    SPI_read( REG_LR_PACONFIG, &(SX1276LR->RegPaConfig), 1 );

    if( ( SX1276LR->RegPaConfig & RFLR_PACONFIG_PASELECT_PABOOST ) == RFLR_PACONFIG_PASELECT_PABOOST )
    {    
        if( enale == TRUE )
        {
            SX1276LR->RegPaDac = 0x87;
        }
    }
    else
    {
        SX1276LR->RegPaDac = 0x84;
    }
    SPI_write( REG_LR_PADAC, &(SX1276LR->RegPaDac), 1 );
}

static void SX1276LoRaSetRFPower( int8_t power )
{
    SPI_read( REG_LR_PACONFIG, &(SX1276LR->RegPaConfig), 1 );
    SPI_read( REG_LR_PADAC, &(SX1276LR->RegPaDac), 1 );
    
    if( ( SX1276LR->RegPaConfig & RFLR_PACONFIG_PASELECT_PABOOST ) == RFLR_PACONFIG_PASELECT_PABOOST )
    {
        if( ( SX1276LR->RegPaDac & 0x87 ) == 0x87 )
        {
            if( power < 5 )
            {
                power = 5;
            }
            if( power > 20 )
            {
                power = 20;
            }
            SX1276LR->RegPaConfig = ( SX1276LR->RegPaConfig & RFLR_PACONFIG_MAX_POWER_MASK ) | 0x70;
            SX1276LR->RegPaConfig = ( SX1276LR->RegPaConfig & RFLR_PACONFIG_OUTPUTPOWER_MASK ) | ( uint8_t )( ( uint16_t )( power - 5 ) & 0x0F );
        }
        else
        {
            if( power < 2 )
            {
                power = 2;
            }
            if( power > 17 )
            {
                power = 17;
            }
            SX1276LR->RegPaConfig = ( SX1276LR->RegPaConfig & RFLR_PACONFIG_MAX_POWER_MASK ) | 0x70;
            SX1276LR->RegPaConfig = ( SX1276LR->RegPaConfig & RFLR_PACONFIG_OUTPUTPOWER_MASK ) | ( uint8_t )( ( uint16_t )( power - 2 ) & 0x0F );
        }
    }
    else
    {
        if( power < -1 )
        {
            power = -1;
        }
        if( power > 14 )
        {
            power = 14;
        }
        SX1276LR->RegPaConfig = ( SX1276LR->RegPaConfig & RFLR_PACONFIG_MAX_POWER_MASK ) | 0x70;
        SX1276LR->RegPaConfig = ( SX1276LR->RegPaConfig & RFLR_PACONFIG_OUTPUTPOWER_MASK ) | ( uint8_t )( ( uint16_t )( power + 1 ) & 0x0F );
    }
    SPI_write( REG_LR_PACONFIG, &(SX1276LR->RegPaConfig), 1 );
    LoRaSettings.Power = power;
}

static void SX1276LoRaSetNbTrigPeaks( uint8_t value )
{
    SPI_read( 0x31, &(SX1276LR->RegTestReserved31), 1 );
    SX1276LR->RegTestReserved31 = ( SX1276LR->RegTestReserved31 & 0xF8 ) | value;
    SPI_write( 0x31, &(SX1276LR->RegTestReserved31), 1 );
}

static void SX1276WriteRxTx( uint8_t txEnable )
{
    if( txEnable != 0 )
    {
        GPIO_WriteLow(CTRL1_PORT, CTRL1_PIN);
        GPIO_WriteHigh(CTRL2_PORT, CTRL2_PIN);
    }
    else
    {
        GPIO_WriteHigh(CTRL1_PORT, CTRL1_PIN);
        GPIO_WriteLow(CTRL2_PORT, CTRL2_PIN);
    }
}